In [72]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [90]:
df = pd.read_csv('data/employees.csv')

In [91]:
df.head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [75]:
df.shape

(1000, 8)

In [93]:
df.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [94]:
df['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [95]:
df.describe(include ='all' )

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
count,933,855,1000,1000,1000.000000,1000.000000,933,957
unique,200,2,972,720,NaN,NaN,2,10
top,Marilyn,Female,10/30/1994,1:35 PM,NaN,NaN,True,Client Services
freq,11,431,2,5,NaN,NaN,468,106
mean,NaN,NaN,NaN,NaN,90662.181000,10.207555,NaN,NaN
std,NaN,NaN,NaN,NaN,32923.693342,5.528481,NaN,NaN
min,NaN,NaN,NaN,NaN,35013.000000,1.015000,NaN,NaN
25%,NaN,NaN,NaN,NaN,62613.000000,5.401750,NaN,NaN
50%,NaN,NaN,NaN,NaN,90428.000000,9.838500,NaN,NaN
75%,NaN,NaN,NaN,NaN,118740.250000,14.838000,NaN,NaN
max,NaN,NaN,NaN,NaN,149908.000000,19.944000,NaN,NaN

In [97]:
df.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [79]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [99]:
df.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [100]:
from sklearn.preprocessing import LabelEncoder

# Create an instance of LabelEncoder
le = LabelEncoder()

# Use .loc to explicitly assign transformed values to the DataFrame
df['Gender'] = le.fit_transform(df['Gender'])

In [101]:
df["Gender"].fillna("No Gender", inplace = True)
   
df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [102]:
df['Gender']

0      1
1      1
2      0
3      1
4      1
      ..
995    2
996    1
997    1
998    1
999    1
Name: Gender, Length: 1000, dtype: int32

In [103]:
mode = df['Senior Management'].mode().values[0]
df['Senior Management']= df['Senior Management'].replace(np.nan, mode)
 
df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management     0
Team                 43
dtype: int64

In [104]:
df = df.dropna(axis = 0, how ='any')
 
print(df.isnull().sum())
df.shape

First Name           0
Gender               0
Start Date           0
Last Login Time      0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
dtype: int64

(899, 8)

In [105]:
print(df['Gender'].unique())

[1 0 2]